[{"id": "openntp", "title": "Open NTP", "total": "1574400", "max": "329180", "min": "10", "mean": "7461", "score": "49", "rank": null, "places_count": "211", "icon": null, "category": null, "description": "Computers and network devices have a perversely strong need to have good agreement about what constitutes the current time (accurate precision time is critical for authentication related purposes, accurate event logging, and a host of other things)\n\nMost computers stay synchronized using Network Time Protocol (NTP). Oversimplifying greatly, NTP sets the local time by checking the time as reported by multiple trusted high-precision network-accessible clocks.\n\nJust like DNS, NTP is a UDP-based service, and shares the same weaknesses that DNS does (particularly problems with spoofed traffic, traffic amplification, and unnecessarily promiscuous access to servers).\n\nIt is thus hardly surprising that NTP is being abused for DDoS attacks...", "rank_2014": null, "score_2014": null, "rank_2013": null, "score_2013": null}, {"id": "opendns", "title": "Open DNS", "total": "3865270", "max": "539540", "min": "10", "mean": "18062", "score": "51", "rank": null, "places_count": "214", "icon": null, "category": null, "description": "The Domain Name System (DNS) is pervasive. Collectively, we use it billions of times a day, often without even knowing that it exists. For enterprises, it's their digital identity as well as a critical component of their security architecture. In short: DNS is pervasive and there are many DNS servers on the Internet. Since DNS runs on the [UDP](https://en.wikipedia.org/wiki/User_Datagram_Protocol) protocol, it can be used for [amplification attacks](https://en.wikipedia.org/wiki/Denial-of-service_attack#Reflected_.2F_spoofed_attack). \n\n**Impact of running open recursive DNS servers**\n\nDNS can have an amplification factor of up to 179. In other words: 1 Byte turns into 179 Bytes in DDOS traffic. If only 1000 vulnerable DNS servers in, each with a mere 10 mbit/sec connection participates in a DNS amplification DDOS attack, then the resulting DDOS size will be **1790 GBit/sec**.\nAs a side note: the DDOS attack that brought [spamhaus down](https://blog.cloudflare.com/the-ddos-that-knocked-spamhaus-offline-and-ho/) and cloudflare nearly to its knees , was a mere ~ 100 Gbit/sec.", "rank_2014": null, "score_2014": null, "rank_2013": null, "score_2013": null}, {"id": "spam", "title": "Spam", "total": "118970", "max": "29120", "min": "10", "mean": "868", "score": "46", "rank": null, "places_count": "137", "icon": null, "category": null, "description": "Spam is roughly equivalent to unsolicited telephone marketing calls, except that the user pays for part of the message since everyone shares the cost of maintaining the Internet. Spammers typically send a piece of e-mail to a distribution list in the millions, expecting that only a tiny number of readers will respond to their offer. It has become a major problem for all Internet users.\n\n**Details**\nFrom a security standpoint, spam is not only a nuissance. It also is a vector for further infections! Spam can be used for [phishing mails](https://en.wikipedia.org/wiki/Phishing), delivering [trojan horses/malware](https://en.wikipedia.org/wiki/Trojan_horse_(computing)) or for general social engineering attacks. Reducing spam not only increases an economy's effectiveness, it also makes the Internet safer by a clear factor.", "rank_2014": null, "score_2014": null, "rank_2013": null, "score_2013": null}, {"id": "openssdp", "title": "Open SSDP", "total": "12790400", "max": "2529390", "min": "10", "mean": "61492", "score": "51", "rank": null, "places_count": "208", "icon": null, "category": null, "description": "[SSDP](https://en.wikipedia.org/wiki/Simple_Service_Discovery_Protocol) - the Simple Service Discovery Protocol is used for advertisement and discovery of network services and presence information. It is often enabled in customer end devices (CPEs) such as modems, WLAN modems. Since SSDP runs over UDP, again, it can be used for UDP reflection attacks.\n\n**Details**\n\nSSDP's amplification factor is ~ 30. It is less powerful than NTP.", "rank_2014": null, "score_2014": null, "rank_2013": null, "score_2013": null}]